# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd
ds=pd.Series("4, 8, 15, 16, 23,42 ")

In [2]:
ds

0    4, 8, 15, 16, 23,42
dtype: object

In [3]:
type(ds)

pandas.core.series.Series

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [4]:
var=['Darshan','Roy','Bengaluru','Hello',3,6,'Pavagada','Karnataka','Pandas','India']
data_series=pd.Series(var)

In [5]:
data_series

0      Darshan
1          Roy
2    Bengaluru
3        Hello
4            3
5            6
6     Pavagada
7    Karnataka
8       Pandas
9        India
dtype: object

# Q3

In [12]:
data_frame=[
    ['Name','Age','Gender'],
    ['Alice',25,'Female'],
    ['Bob',30,'Male'],
    ['Roy',18,'Male']
]

data_frame_=pd.DataFrame(data_frame)

In [8]:
data_frame_

       0    1       2
0   Name  Age  Gender
1  Alice   25  Female
2    Bob   30    Male
3    Roy   18    Male

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Data_Frame: DataFrame in Pandas is equivalent to 'Tables', Wich means Collection of rows and Coloumns 
Data_Series: Data_Series is particular colucolumn wich have one type of datatype

the major diffrence between Data_Frame and Data_Series is That Data_Frame is collection of rows and columns 
but Data_Series is Collection of single column 


conclusion:Data_Frame is like a 2D array and Data_Series is like a 1D array

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [18]:
# Data Manipulation on Data_Frames:
import pandas as pd
Data=pd.read_csv('Data.csv')

In [20]:
Data.head() #this shows upper values

,85321,176,Ajo Improvement Co,AZ,Bundled,Investor Owned,0.08789049919484701,0,0.09388714733542321
0,36560,195,Alabama Power Co,AL,Bundled,Investor Owned,0.121895,0.063652,0.135057
1,36513,195,Alabama Power Co,AL,Bundled,Investor Owned,0.121895,0.063652,0.135057
2,36280,195,Alabama Power Co,AL,Bundled,Investor Owned,0.121895,0.063652,0.135057
3,35473,195,Alabama Power Co,AL,Bundled,Investor Owned,0.121895,0.063652,0.135057
4,35229,195,Alabama Power Co,AL,Bundled,Investor Owned,0.121895,0.063652,0.135057

In [21]:
Data.tail() #shows the Last few Values among The file

,85321,176,Ajo Improvement Co,AZ,Bundled,Investor Owned,0.08789049919484701,0,0.09388714733542321
63,35475,195,Alabama Power Co,AL,Bundled,Investor Owned,0.121895,0.063652,0.135057
64,36523,195,Alabama Power Co,AL,Bundled,Investor Owned,0.121895,0.063652,0.135057
65,36040,195,Alabama Power Co,AL,Bundled,Investor Owned,0.121895,0.063652,0.135057
66,35957,195,Alabama Power Co,AL,Bundled,Investor Owned,0.121895,0.063652,0.135057
67,36502,195,Alabama Power Co,AL,Bundled,Investor Owned,0.121895,0.063652,0.135057

In [22]:
Data.info() # gives the information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 68 entries, 0 to 67
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   85321                68 non-null     int64
 1   176                  68 non-null     int64
 2   Ajo Improvement Co   68 non-null     object
 3   AZ                   68 non-null     object
 4   Bundled              68 non-null     object
 5   Investor Owned       68 non-null     object
 6   0.08789049919484701  68 non-null     float64
 7   0                    68 non-null     float64
 8   0.09388714733542321  68 non-null     float64
dtypes: float64(3), int64(2), object(4)
memory usage: 4.9+ KB

In [23]:
Data.describe()  # Computes statistics of the numerical columns in the DataFrame

,85321,176,0.08789049919484701,0,0.09388714733542321
count,68.000000,68.0,6.800000e+01,68.000000,6.800000e+01
mean,35948.941176,195.0,1.218951e-01,0.063652,1.350567e-01
std,606.702954,0.0,9.786679e-17,0.000000,1.957336e-16
min,35004.000000,195.0,1.218951e-01,0.063652,1.350567e-01
25%,35388.750000,195.0,1.218951e-01,0.063652,1.350567e-01
50%,36042.500000,195.0,1.218951e-01,0.063652,1.350567e-01
75%,36502.750000,195.0,1.218951e-01,0.063652,1.350567e-01
max,36855.000000,195.0,1.218951e-01,0.063652,1.350567e-01

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

All are mutable in nature

Panel: A Panel is a three-dimensional data structure, deprecated in pandas. It used to be mutable and allowed for working with three-dimensional data

# Q7. Create a DataFrame using multiple Series. Explain with an example.